{
  "currentVersion": "1.9.3",
  "changelog": [
    {
      "version": "1.9.3",
      "date": "2025-07-04",
      "description": "### ✨ New Features\n\n*   **Select All Search Results**: When searching in the Expenses tab, a 'Select All Results' button now appears, allowing for bulk actions on all matching transactions across all months."
    },
    {
      "version": "1.9.2",
      "date": "2025-07-04",
      "description": "### 🐛 Bug Fixes\n\n*   **UI Tweak**: Relocated the 'Compare with Budget' dropdown on the Expenses tab to be next to the month selector for a more intuitive layout."
    },
    {
      "version": "1.9.1",
      "date": "2025-07-04",
      "description": "### 🐛 Bug Fixes\n\n*   **Expense Report**: The printable expense report will now correctly display an 'Actual Expenses' section even when no budget is selected for comparison."
    },
    {
      "version": "1.9.0",
      "date": "2025-07-04",
      "description": "### ✨ New Features\n\n*   **Printable Expense Report**: Added a 'Report' button to the Expenses tab. This generates a comprehensive, print-friendly report for the selected month, which includes an 'Expenses by Spending Type' matrix and an 'Actual vs. Budgeted' comparison."
    },
    {
      "version": "1.8.0",
      "date": "2025-07-03",
      "description": "### ✨ New Features\n\n*   **Expense Spending Types**: Transactions can now be classified as 'Non-Discretionary', 'Discretionary', or 'One-Time' via a new dropdown in the Expenses tab. This allows for more granular spending analysis.\n*   **Bulk Update Spending Type**: Added the ability to update the spending type for multiple selected transactions at once."
    },
    {
      "version": "1.7.0",
      "date": "2025-07-03",
      "description": "### ✨ New Features\n\n*   **Data Deletion Safety**: Added confirmation dialogs for deleting asset and expense data to prevent accidental data loss. Users must type \"DELETE\" to confirm."
    },
    {
      "version": "1.6.0",
      "date": "2025-07-01",
      "description": "### ✨ New Features\n\n*   **Dynamic Budget Chart**: When a budget is selected on the Expenses tab, the 'Spending by Category' chart now defaults to a more intuitive stacked bar view. This view clearly shows 'Spent', 'Overspent', and 'Remaining' budget portions for each category. A toggle has been added to switch between the new 'Stacked' and original 'Grouped' views."
    },
    {
      "version": "1.5.1",
      "date": "2025-07-01",
      "description": "### 🐛 Bug Fixes\n\n*   Fixed a critical bug where monthly and per-category expense totals did not correctly exclude amounts from unchecked sub-categories."
    },
    {
      "version": "1.5.0",
      "date": "2025-07-01",
      "description": "### ✨ New Features\n\n*   **Included Category Highlighting**: On the Expenses tab, categories that are included in the monthly spending totals are now highlighted with a light green background for better visibility."
    },
    {
      "version": "1.4.0",
      "date": "2025-07-01",
      "description": "### ✨ New Features\n\n*   **Dynamic Expense Dashboard**: The Expenses tab now includes a dropdown to select and view spending data for any previous month. The 'Monthly Spending' and 'Spending by Category' charts update dynamically to reflect the chosen month."
    },
    {
      "version": "1.3.1",
      "date": "2025-07-01",
      "description": "### 🐛 Bug Fixes\n\n*   Fixed a layout issue where the 'Spending by Category' chart could overflow its container on initial load."
    },
    {
      "version": "1.3.0",
      "date": "2025-07-01",
      "description": "### ✨ New Features\n\n*   **Consolidated Top Movers**: The 'Top Movers' section on the Assets dashboard now aggregates holdings by stock symbol, showing a combined total gain/loss across all accounts."
    },
    {
      "version": "1.2.1",
      "date": "2025-07-01",
      "description": "### 🐛 Bug Fixes\n\n*   Restored the missing icon for the 'Import' button on the Expenses tab."
    },
    {
      "version": "1.2.0",
      "date": "2025-07-01",
      "description": "### ✨ New Features\n\n*   **Versioning System**: Added a version number to the footer and a 'What's New' changelog modal to track new features and updates.\n*   **Local-Only Mode**: The application is now fully functional without logging in. All data is stored privately in the browser's local storage."
    },
    {
      "version": "1.1.0",
      "date": "2025-06-27",
      "description": "### ✨ New Features\n\n*   **Email & Password Authentication**: Replaced Google Sign-In with a secure email and password authentication system using Firebase.\n*   **Auth Form**: Created a new, dedicated form for user sign-up and login, with clear error handling."
    },
    {
      "version": "1.0.0",
      "date": "2025-06-25",
      "description": "### 🎉 Initial Release\n\n*   Track financial accounts, stock holdings, and cash balances.\n*   View asset allocation and net worth history.\n*   Import and categorize expense transactions from CSV files.\n*   Create and manage budgets based on spending history."
    }
  ]
}